Autodesk.Revit.DB.Structure.RebarHostData.IsValidHost(Autodesk.Revit.DB.Element)
Identifies whether a given element can host reinforcement.
Remarks:
Many different elements are permitted to host reinforcement,
for example, beams, walls, columns, or parts.
Often there are specific restrictions about whether an element
can host rebar beyond its type or category.
For example, the material type of the element may determine this.
Or for parts, the part must have been created from layers
that have their function set to Structure.
element:
The element to check.
Returns:
True if the input Element can host reinforcement elements,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015